# 计算交割合约的触发爆仓价格

# 梯度保证金
# https://www.okex.win/trade-market/position/futures

# 交割币本位
# [档位，最小币数，最大币数，维持保证金率，最低初始保证金率，最高可用杠杆倍数]
coinFpt = [
    [1, 0, 500, 0.40, 0.80, 125.00],
    [2, 501, 3000, 0.50, 1.00, 100.00],
    [3, 3001, 22000, 1.00, 1.50, 66.66],
    [4, 22001, 42000, 1.50, 2.00, 50.00],
    [5, 42001, 62000, 2.00, 2.50, 40.00],
    [6, 62001, 82000, 2.50, 3.00, 33.33],
    [7, 82001, 102000, 3.00, 3.50, 28.57],
    [8, 102001, 122000, 3.50, 4.00, 25.00],
    [9, 122001, 142000, 4.00, 4.50, 22.22],
    [10, 142001, 162000, 4.50, 5.00, 20.00],
    [11, 162001, 182000, 5.00, 5.50, 18.18],
    [12, 182001, 202000, 5.50, 6.00, 16.66],
    [13, 202001, 222000, 6.00, 6.50, 15.38],
    [14, 222001, 242000, 6.50, 7.00, 14.28],
    [15, 242001, 262000, 7.00, 7.50, 13.33],
    [16, 262001, 282000, 7.50, 8.00, 12.50],
    [17, 282001, 302000, 8.00, 8.50, 11.76],
    [18, 302001, 322000, 8.50, 9.00, 11.11],
    [19, 322001, 342000, 9.00, 9.50, 10.52],
    [20, 342001, 362000, 9.50, 10.00, 10.00]
]

# 交割美元本位
# [档位，最小张数，最大张数，维持保证金率，最低初始保证金率，最高可用杠杆倍数]
usdtFpt = [
    [1, 0, 200, 0.40, 0.80, 125.00],
    [2, 201, 1000, 0.50, 1.00, 100.00],
    [3, 1001, 11000, 1.00, 1.50, 66.66],
    [4, 11001, 21000, 1.50, 2.00, 50.00],
    [5, 21001, 31000, 2.00, 2.50, 40.00],
    [6, 31001, 41000, 2.50, 3.00, 33.33],
    [7, 41001, 51000, 3.00, 3.50, 28.57],
    [8, 51001, 61000, 3.50, 4.00, 25.00],
    [9, 61001, 71000, 4.00, 4.50, 22.22],
    [10, 71001, 81000, 4.50, 5.00, 20.00],
    [11, 81001, 91000, 5.00, 5.50, 18.18],
    [12, 91001, 101000, 5.50, 6.00, 16.66],
    [13, 101001, 111000, 6.00, 6.50, 15.38],
    [14, 111001, 121000, 6.50, 7.00, 14.28],
    [15, 121001, 131000, 7.00, 7.50, 13.33],
    [16, 131001, 141000, 7.50, 8.00, 12.50],
    [17, 141001, 151000, 8.00, 8.50, 11.76],
    [18, 151001, 161000, 8.50, 9.00, 11.11],
    [19, 161001, 171000, 9.00, 9.50, 10.52],
    [20, 171001, 181000, 9.50, 10.00, 10.00]
]

# 保证金类型： 
mgnTypeList = ["PA：币本位", "BS：美元本位"]
mgnTypeChoose = 0
# 保证金模式：
mgnModeList = ["cross：全仓", "isolated：逐仓"]
mgnModeChoose = 0
# 手续费 https://www.okex.com/fees.html
# 合约爆仓手续费按照用户当前所处等级的taker费率收取。
# 挂单手续费 (这里要按自己的用户等级调整)
makerFee = 0
# 吃单手续费 (这里要按自己的用户等级调整)
takerFee = 0
# 最新标记价格
lastMarkPrice = 0


# 币本位所需保证金：(购入价格,购入数/张,杠杆倍数,保证金余额,持仓方向)
def clacPAMgn(buyPrice,buyCount,lever,availEq,posSide):
    # 档位
    level = 0
    # 档位维持保证金率
    levelMgnRate = 0
    # 最低初始保证金率
    minLevelMgnRate = 0
    for item in coinFpt:
        if buyCount >= item[1] & buyCount <= item[2] :
            level = item[0]
            levelMgnRate = item[3]
            minLevelMgnRate = item[4]
    # 平仓手续费率 (爆仓时按照吃单计算) 
    clossFee = takerFee
    # 逐仓保证金率
    # 保证金率 = (固定保证金 + 未实现盈亏) / (面值 * 张数 / 最新标记价格)
    # 未实现盈亏 (买入开多) = (面值 * 张数 / 开仓均价 - 面值 * 张数 / 最新标记价格) * 持仓量
    # 未实现盈亏 (卖出开空) = (面值 * 张数 / 最新成交价 - 面值 * 张数 / 开仓均价) * 持仓量
    # isolatedMgn = (availEq + upl) / (buyPrice * buyCount / lastPrice)
    # 当保证金率小于等于用户当前所需维持保证金率 + 平仓手续费率时，即触发爆仓
    # 当前所需维持保证金率 + 平仓手续费率
    keyRate = levelMgnRate + clossFee
    if posSide == 'long':
        # 保证金率 A = (固定保证金 B + (合约价值 C / 结算基准价 D - 合约价值 C / 最新成交价 E) * 持仓量 F) / (面值 D * 张数 F / 最新标记价格 G)
        # A = (B+(C/D-C/E)*F)/(D*F/G)
        # 求最新成交价(触发爆仓的价格) E
        # E = 




# 美元本位所需保证金：(购入价格,购入数,杠杆倍数,保证金余额,持仓方向)
def clacBSMgn(buyPrice,buyCount,lever,availEq,posSide):
    return
